#三只股票各占0.2，另有0.4现金
import pandas as pd

weight_a=0.2
weight_b=0.2
weight_c=0.2
#模拟5个交易日里，三只股票每天的涨跌幅
df=pd.DataFrame(
    {
        '交易日期':pd.to_datetime([
            '2026-06-01',
            '2026-06-02',
            '2026-06-03',
            '2026-06-04',
            '2026-06-05',
        ]),
        'A收益率':[0.02,-0.01,0.01,0.00,0.03],
        'B收益率':[-0.02,-0.02,0.06,0.01,0.05],
        'C收益率':[0.1,-0.01,3.01,1.00,6.03],

    }
)
#每一天的组合收益率
df['组合收益率']=(df['A收益率']*weight_a+df['B收益率']*weight_b+df['C收益率']*weight_c)
#组合累积收益率
df['组合累积收益率']=(1+df['组合收益率']).cumprod()-1
#净值
df['组合净值']=1+df['组合累积收益率']
print(df)